app/Services/Chat/ChatService.php

    public function sendMessage(int $conversationId, int $senderId, string $body): Message
    {
        // Load conversation and validate participation
        $conversation = $this->repository->findConversation($conversationId);
        $this->ensureParticipant($conversation, $senderId);

        // Create message and update conversation timestamp inside a transaction
        $message = DB::transaction(function () use ($conversation, $conversationId, $senderId, $body) {
            $message = $this->repository->createMessage($conversationId, $senderId, $body);

            // Update last_message_at for inbox ordering
            $conversation->update(['last_message_at' => now()]);
---
update `conversations` set `last_message_at` = '2026-02-19 21:59:54', `conversations`.`updated_at` = '2026-02-19 21:59:54' where `id` = 2