app/Services/Reaction/ReactionService.php

insert into `reactions` (`user_id`, `type`, `reactable_id`, `reactable_type`, `updated_at`, `created_at`) values (1, 'love', 94, 'App\\Models\\Comment', '2026-02-17 13:09:12', '2026-02-17 13:09:12')
---
    }

    // ✅ create باستخدام string
    $reaction = $reactable->reactions()->create([
        'user_id' => $user->id,
        'type' => $reactionType->value,
    ]);