app/Repositories/Like/Eloquent/EloquentLikeRepository.php

select * from `users` where `users`.`id` in (1)
---
    public function findByLikeable($likeableType, $likeableId)
    {
        return $this->model->where('likeable_type', $likeableType)
            ->where('likeable_id', $likeableId)
            ->with('user')
            ->get();

delete from `likes` where `id` = 24
insert into `likes` (`user_id`, `likeable_type`, `likeable_id`, `updated_at`, `created_at`) values (1, 'App\\Models\\Post', 99994, '2026-02-14 12:53:58', '2026-02-14 12:53:58')
---
    public function toggle(User $user, string $likeableType, int $likeableId)
    {
        $existing = $this->model->where('user_id', $user->id)
            ->where('likeable_type', $likeableType)
            ->where('likeable_id', $likeableId)
            ->first();

        if ($existing) {
            $existing->delete();
            return ['action' => 'unliked', 'like' => null];
        }

        $like = $this->create([
            'user_id' => $user->id,
            'likeable_type' => $likeableType,
            'likeable_id' => $likeableId,
        ]);