app/Services/Notification/NotificationService.php

select * from `notifications` where `id` = 3 and `user_id` = 1 limit 1
---
    public function markAsRead(int $notificationId, int $userId): bool
    {
        $notification = Notification::where('id', $notificationId)
            ->where('user_id', $userId)
            ->first();