app/Services/Notification/NotificationService.php

insert into `notifications` (`user_id`, `from_user_id`, `type`, `notifiable_type`, `notifiable_id`, `message`, `data`, `updated_at`, `created_at`) values (3876, 1, 'like', 'App\\Models\\Post', 99994, 'Test User liked your post', '{\"post_id\":99994,\"like_id\":32}', '2026-02-14 12:53:58', '2026-02-14 12:53:58')
---
    public function create(
        int $userId,
        int $fromUserId,
        string $type,
        Model $notifiable,
        string $message,
        array $data = []
    ): Notification {
        // Don't notify yourself
        if ($userId === $fromUserId) {
            return new Notification();
        }

        $notification = Notification::create([
            'user_id' => $userId,
            'from_user_id' => $fromUserId,
            'type' => $type,
            'notifiable_type' => get_class($notifiable),
            'notifiable_id' => $notifiable->id,
            'message' => $message,
            'data' => $data,
        ]);

select * from `notifications` where `user_id` = 1 order by `created_at` desc limit 20
select * from `users` where `users`.`id` in (10004, 10005)
---
    public function getUserNotifications(int $userId, int $limit = 20)
    {
        return Notification::where('user_id', $userId)
            ->with('fromUser')
            ->orderBy('created_at', 'desc')
            ->limit($limit)
            ->get();

update `notifications` set `read_at` = '2026-02-19 22:36:00', `notifications`.`updated_at` = '2026-02-19 22:36:00' where `user_id` = 1 and `read_at` is null
---
    public function markAllAsRead(int $userId): void
    {
        Notification::where('user_id', $userId)
            ->unread()
            ->update(['read_at' => now()]);

select * from `notifications` where `id` = 142 and `user_id` = 10004 limit 1
---
    public function markAsRead(int $notificationId, int $userId): bool
    {
        $notification = Notification::where('id', $notificationId)
            ->where('user_id', $userId)
            ->first();