routes/channels.php

select * from `conversations` where `conversations`.`id` = '2' limit 1
---

// Chat: only conversation participants can subscribe
Broadcast::channel('chat.{conversationId}', function ($user, $conversationId) {
    $conversation = \App\Models\Conversations::find($conversationId);