app/Repositories/Post/Eloquent/EloquentPostRepository.php

    public function getUserSharedPosts(User $user)
    {
        return $user->shares()
            ->with(['post' => fn($q) => $this->withListRelations($q)])
            ->latest()
            ->cursorPaginate(20);
---
select * from `shares` where `shares`.`user_id` = 2 and `shares`.`user_id` is not null order by `created_at` desc limit 21