app/Repositories/Post/Eloquent/EloquentPostRepository.php

    public function getFeed(User $user, int $limit = 20)
    {
        $friendIds = $user->friends()->pluck('id')->toArray();

        return $this->model->where(function ($query) use ($user, $friendIds) {
            // User's own posts
            $query->where('user_id', $user->id)
                // Public posts
                ->orWhere('privacy', PrivacyTypeEnum::Public)
                // Friends' posts (public or friends-only)
                ->orWhere(function ($q) use ($friendIds) {
                    $q->whereIn('user_id', $friendIds)
                        ->whereIn('privacy', [PrivacyTypeEnum::Public, PrivacyTypeEnum::Friends]);
                });
        })
            ->with(['user'])
            ->withCount(['likes', 'comments'])
            ->latest()
            ->limit($limit)
            ->get();
---
select * from `comments` where `comments`.`post_id` in (99986)
select * from `users` where `users`.`id` in (3846)

    public function getPublicPosts(int $limit = 10)
    {
        return $this->model
            ->with(['user', 'comments', 'likes', 'shares'])
            ->where('privacy', 'public')
            ->orderBy('id', 'desc')
            ->take($limit)
            ->get();
---
select * from `shares` where `shares`.`post_id` in (99986)

    public function getUserPostsWithRelations(User $user, bool $publicOnly = false)
    {
        $query = $user->posts()
            ->with(['user', 'comments', 'likes', 'shares'])
            ->latest();

        if ($publicOnly) {
            $query->where('privacy', 'public');
        }

        return $query->get();
---
select * from `users` where `users`.`id` in (759, 1700, 1985, 3254, 3846, 3876, 4375, 5602, 6862, 8220)

    public function getUserSharedPosts(User $user)
    {
        return $user->shares()
            ->with(['post.user', 'post.comments', 'post.likes', 'post.shares'])
            ->latest()
            ->get();
---
select * from `users` where `users`.`id` in (657, 1056, 1166, 1646, 1794, 1865, 2055, 2975, 5275, 8540)

    public function getSavedPostsForUser(User $user)
    {
        return $user->savedPosts()
            ->with(['user', 'comments', 'likes', 'shares'])
            ->orderByPivot('created_at', 'desc')
            ->get();
---
select * from `shares` where `shares`.`user_id` = 1 and `shares`.`user_id` is not null order by `created_at` desc
select * from `users` where `users`.`id` in (820, 1951, 2019, 3885, 4802, 5885, 5919, 7347, 7374, 8097, 9423)