app/Services/Feed/FeedService.php

select CASE WHEN sender_id = 2 THEN receiver_id ELSE sender_id END as friend_id from `friendships` where `status` = 'accepted' and (`sender_id` = 2 or `receiver_id` = 2)
select `id`, `likes_count`, `comments_count`, `shares_count`, `created_at` from `posts` where (`user_id` = 2 or (`user_id` in (228, 1195, 7701, 6342, 6830, 6219, 7113, 3007, 6384, 4208) and `privacy` in ('public', 'friends'))) and `created_at` >= '2026-02-19 15:28:54'
---
    private function generateAndCacheFeed(User $user, string $redisKey): void
    {
        // 1. Get friend IDs
        $friendIds = Friendship::selectRaw('CASE WHEN sender_id = ? THEN receiver_id ELSE sender_id END as friend_id', [$user->id])
            ->where('status', FriendshipStatusEnum::Accepted->value)
            ->where(function ($q) use ($user) {
                $q->where('sender_id', $user->id)
                    ->orWhere('receiver_id', $user->id);
            })
            ->pluck('friend_id');

        // 2. Fetch Candidates (posts from friends in last 72 hours)
        $candidatesQuery = Post::select('id', 'likes_count', 'comments_count', 'shares_count', 'created_at')
            ->where(function ($q) use ($user, $friendIds) {
                $q->where('user_id', $user->id)
                    ->orWhere(function ($q2) use ($friendIds) {
                        $q2->whereIn('user_id', $friendIds)
                            ->whereIn('privacy', [PrivacyTypeEnum::Public->value, PrivacyTypeEnum::Friends->value]);
                    });
            })
            ->where('created_at', '>=', now()->subDays(3));

        $candidates = $candidatesQuery->get();

select CASE WHEN sender_id = 2 THEN receiver_id ELSE sender_id END as friend_id from `friendships` where `status` = 'accepted' and (`sender_id` = 2 or `receiver_id` = 2)
select `posts`.*, (select count(*) from `reactions` where `posts`.`id` = `reactions`.`reactable_id` and `reactions`.`reactable_type` = 'App\\Models\\Post') as `reactions_count`, (select count(*) from `comments` where `posts`.`id` = `comments`.`post_id`) as `comments_count`, (select count(*) from `shares` where `posts`.`id` = `shares`.`post_id`) as `shares_count`, posts.*, ( (likes_count * 1 + comments_count * 3 + shares_count * 5 + 1) /
POWER(TIMESTAMPDIFF(HOUR, created_at, NOW()) + 2, 1.8) ) as feed_score, exists(select * from `shares` where `posts`.`id` = `shares`.`post_id` and `user_id` = 2) as `is_shared`, exists(select * from `users` inner join `saved_posts` on `users`.`id` = `saved_posts`.`user_id` where `posts`.`id` = `saved_posts`.`post_id` and `user_id` = 2) as `is_saved`, exists(select * from `reactions` where `posts`.`id` = `reactions`.`reactable_id` and `reactions`.`reactable_type` = 'App\\Models\\Post' and `user_id` = 2) as `is_reacted` from `posts` where (`user_id` = 2 or (`user_id` in (228, 1195, 7701, 6342, 6830, 6219, 7113, 3007, 6384, 4208) and `privacy` in ('public', 'friends'))) order by `feed_score` desc limit 10 offset 0
select * from `users` where `users`.`id` in (2, 228, 4208, 6219, 6830, 7113, 7701)
---
    private function getSmartFeedFallback(User $user, int $page, int $perPage)
    {
        $friendIds = Friendship::selectRaw('CASE WHEN sender_id = ? THEN receiver_id ELSE sender_id END as friend_id', [$user->id])
            ->where('status', FriendshipStatusEnum::Accepted->value)
            ->where(function ($q) use ($user) {
                $q->where('sender_id', $user->id)
                    ->orWhere('receiver_id', $user->id);
            })
            ->pluck('friend_id');

        $gravity = self::GRAVITY;
        $query = Post::with(['user'])
            ->withCount(['reactions', 'comments', 'shares'])
            ->selectRaw("posts.*, ( (likes_count * ? + comments_count * ? + shares_count * ? + 1) /
                POWER(TIMESTAMPDIFF(HOUR, created_at, NOW()) + 2, ?) ) as feed_score", [
                self::LIKE_WEIGHT,
                self::COMMENT_WEIGHT,
                self::SHARE_WEIGHT,
                $gravity
            ]);

        if ($user) {
            $query->withExists([
                'shares as is_shared' => fn($q) => $q->where('user_id', $user->id),
                'savedBy as is_saved' => fn($q) => $q->where('user_id', $user->id),
                'reactions as is_reacted' => fn($q) => $q->where('user_id', $user->id)
            ])->with(['reactions' => fn($q) => $q->where('user_id', $user->id)]);
        }

        $posts = $query->where(function ($q) use ($user, $friendIds) {
            $q->where('user_id', $user->id)
                ->orWhere(function ($q2) use ($friendIds) {
                    $q2->whereIn('user_id', $friendIds)
                        ->whereIn('privacy', [PrivacyTypeEnum::Public->value, PrivacyTypeEnum::Friends->value]);
                });
        })
            ->orderByDesc('feed_score')
            ->forPage($page, $perPage)
            ->get();

select `reactable_id`, `type`, count(*) as count from `reactions` where `reactable_type` = 'App\\Models\\Post' and `reactable_id` in (24714, 33335, 72051, 21532, 67529, 78440, 58339, 80114, 6704, 14420) group by `reactable_id`, `type`
---
    private function appendInteractions($posts, int $userId): void
    {
        if ($posts->isEmpty()) return;

        // Fetch all grouped reaction counts for these posts in a single query
        $postIds = $posts->pluck('id')->toArray();
        $reactionGroups = \Illuminate\Support\Facades\DB::table('reactions')
            ->select('reactable_id', 'type', \Illuminate\Support\Facades\DB::raw('count(*) as count'))
            ->where('reactable_type', Post::class)
            ->whereIn('reactable_id', $postIds)
            ->groupBy('reactable_id', 'type')
            ->get()
            ->groupBy('reactable_id');