app/Services/Comment/CommentService.php

select * from `users` where `users`.`id` in (1)
---
    public function formatNewComment($comment, ?User $authUser = null): array
    {
        if ($authUser && $comment->user_id === $authUser->id) {
            $comment->setRelation('user', $authUser);
        }

        $comment->loadMissing(['user', 'reactions', 'mentions.mentionedUser']);

        // New comment has no reactions yet
        $userReaction = null;
        $reactionCounts = [];

        if ($authUser) {
            $userReaction = $comment->reactions()
                ->where('user_id', $authUser->id)
                ->first();