app/Events/NewNotification.php

select * from `users` where `users`.`id` in (2)
---
    public function __construct(Notification $notification)
    {
        $this->notification = $notification->load('fromUser');