app/Repositories/Comment/Eloquent/EloquentCommentRepository.php

    public function find($id)
    {
        return $this->model->with(['user', 'post', 'replies.user'])->findOrFail($id);
---
select * from `posts` where `posts`.`id` in (35)
select * from `users` where `users`.`id` in (15)

    public function findRootCommentsByPost($postId)
    {
        return $this->model->where('post_id', $postId)
            ->whereNull('parent_id')
            ->with(['user', 'replies.user', 'likes'])
            ->withCount('likes', 'replies')
            ->latest()
            ->get();
---
select * from `users` where `users`.`id` in (4543, 4946, 7209, 8528, 8838, 8897)

    public function findReplies($commentId)
    {
        return $this->model->where('parent_id', $commentId)
            ->with(['user', 'likes'])
            ->withCount('likes')
            ->latest()
            ->get();
---
select * from `users` where `users`.`id` in (1470, 1517, 1523, 4496, 5035, 5066, 5607, 6718, 6823, 8796, 8987, 9982)