app/Repositories/Friendship/Eloquent/EloquentFriendshipRepository.php

select * from `users` where `id` in (228, 1195, 7701, 6342, 6830, 6219, 7113, 3007, 6384, 4208)
---
    public function getFriendsOf(User $user)
    {
        $sentAccepted = $this->model->where('sender_id', $user->id)
            ->where('status', FriendshipStatusEnum::Accepted)
            ->pluck('receiver_id');

        $receivedAccepted = $this->model->where('receiver_id', $user->id)
            ->where('status', FriendshipStatusEnum::Accepted)
            ->pluck('sender_id');

        return User::whereIn('id', $sentAccepted->merge($receivedAccepted))->get();