app/Models/Comment.php

update `posts` set `comments_count` = `comments_count` + 1, `posts`.`updated_at` = '2026-02-23 19:42:36' where `id` = 38584
---
    protected static function booted()
    {
        static::created(function ($comment) {
            if ($comment->post_id) {
                Post::where('id', $comment->post_id)->increment('comments_count');