app/Models/Notification.php

update `notifications` set `read_at` = '2026-02-23 19:32:28', `notifications`.`updated_at` = '2026-02-23 19:32:28' where `id` = 3
---
    public function markAsRead(): void
    {
        if (is_null($this->read_at)) {
            $this->update(['read_at' => now()]);