app/Repositories/Chat/Eloquent/EloquentChatRepository.php

select * from `conversations` where `conversations`.`id` = 2 limit 1
---
    public function findConversation(int $conversationId): Conversations
    {
        return $this->conversationModel->with(['userOne', 'userTwo'])->findOrFail($conversationId);

select * from `conversations` where (`user_one_id` = 1 and `user_two_id` = 2) or (`user_one_id` = 2 and `user_two_id` = 1) limit 1
---
    public function findConversationBetween(int $userOneId, int $userTwoId): ?Conversations
    {
        return $this->conversationModel
            ->where(function ($query) use ($userOneId, $userTwoId) {
                $query->where('user_one_id', $userOneId)
                    ->where('user_two_id', $userTwoId);
            })
            ->orWhere(function ($query) use ($userOneId, $userTwoId) {
                $query->where('user_one_id', $userTwoId)
                    ->where('user_two_id', $userOneId);
            })
            ->first();

select * from `conversations` where (`user_one_id` = 1 or `user_two_id` = 1)
select * from `users` where `users`.`id` in (1)
---
    public function getConversationsForUser(int $userId): Collection
    {

        return $this->conversationModel
            ->forUser($userId)
            ->with(['userOne', 'userTwo', 'latestMessage'])
            ->get();

insert into `messages` (`conversation_id`, `sender_id`, `body`, `updated_at`, `created_at`) values (2, 2, 'test', '2026-02-19 21:59:53', '2026-02-19 21:59:53')
---
    public function createMessage(int $conversationId, int $senderId, string $body): Message
    {
        return $this->messageModel->create([
            'conversation_id' => $conversationId,
            'sender_id' => $senderId,
            'body' => $body,
        ]);

select * from `messages` where `conversation_id` = 2 order by `created_at` desc limit 30 offset 0
select count(*) as aggregate from `messages` where `conversation_id` = 2
---
    public function getMessages(int $conversationId, int $perPage = 20): LengthAwarePaginator
    {
        return $this->messageModel
            ->where('conversation_id', $conversationId)
            ->with(['sender:id,name,profile_picture'])  // profile_picture needed for avatar_url accessor
            ->orderBy('created_at', 'desc')             // newest-first; blade/JS reverses for display
            ->paginate($perPage);

update `messages` set `read_at` = '2026-02-19 20:22:20', `messages`.`updated_at` = '2026-02-19 20:22:20' where `conversation_id` = 2 and `sender_id` != 1 and `read_at` is null
---
    public function markMessagesAsRead(int $conversationId, int $userId): int
    {
        return $this->messageModel
            ->where('conversation_id', $conversationId)
            ->where('sender_id', '!=', $userId)   // only other user's messages
            ->whereNull('read_at')                 // only unread
            ->update(['read_at' => now()]);

select count(*) as aggregate from `messages` where `read_at` is null and `sender_id` != 2 and exists (select * from `conversations` where `messages`.`conversation_id` = `conversations`.`id` and (`user_one_id` = 2 or `user_two_id` = 2))
---
    public function getUnreadCountForUser(int $userId): int
    {

        return $this->messageModel
            ->whereNull('read_at')
            ->where('sender_id', '!=', $userId)
            ->whereHas('conversation', function ($query) use ($userId) {
                $query->where('user_one_id', $userId)
                    ->orWhere('user_two_id', $userId);
            })
            ->count();